// Задача 19
// Console.Clear();
// Console.WriteLine("Введите пятизначное число ");
// string x = Console.ReadLine()!;
// if (x[1] == x[3] & x[0] == x[4])
//     Console.WriteLine("палиндром");
// else
//     Console.WriteLine("не палиндром");

// Задача 21
// Console.Clear();
// Console.Write("Введите координату X(1) ");
// double x1 = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите координату X(2) ");
// double x2 = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите координату Y(1) ");
// double y1 = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите координату Y(2) ");
// double y2 = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите координату Z(1) ");
// double z1 = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите координату Z(2) ");
// double z2 = Convert.ToDouble(Console.ReadLine());
// double s = Math.Sqrt(Math.Pow(x1-x2, 2) + Math.Pow(y2-y1, 2) + Math.Pow(z1-z2, 2));
// Console.WriteLine($"Расстояние между двумя точками {Math.Round(s, 2)}");

//  Задача 23
// Console.Clear();
// Console.WriteLine("Введите число  ");
// int a = Convert.ToInt32(Console.ReadLine());
// for (int i = 1; i <= a; i++)
//     Console.Write($" {Math.Pow(i, 3)}");
//     // Console.WriteLine($"{i} ^ 3 = {i * i * i}");